## Plan Result (prod_shutter_static_webapp)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;darts-portal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;darts-portal&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;darts-portal&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;darts-portal&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["darts-portal"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apps.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["darts-portal"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.darts"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "apps.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["darts-portal"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "darts-portal"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["darts-portal"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "darts.apps.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["darts-portal"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "darts_portal_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (7 unchanged elements hidden)
        {
            backend_domain = [
                "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
            cache_enabled  = "false"
            custom_domain  = "juror.apps.hmcts.net"
            custom_rules   = [
                {
                    action           = "Block"
                    match_conditions = [
                        {
                            match_values       = [
                                "194.33.192.0/24",
                                "194.33.196.0/24",
                                "194.33.200.0/21",
                                "194.33.248.0/24",
                                "194.33.249.0/24",
                                "51.149.249.0/27",
                                "51.149.249.32/27",
                                "51.149.250.0/23",
                                "194.33.216.0/23",
                                "194.33.218.0/24",
                                "128.77.75.64/26",
                                "20.50.108.242/32",
                                "20.50.109.148/32",
                            ]
                            match_variable     = "RemoteAddr"
                            negation_condition = true
                            operator           = "IPMatch"
                        },
                    ]
                    name             = "IPMatchWhitelist"
                    priority         = 1
                    type             = "MatchRule"
                },
            ]
            disabled_rules = {
                RCE  = [
                    "932100",
                    "932105",
                    "932110",
                    "932115",
                    "932150",
                ]
                SQLI = [
                    "942100",
                    "942110",
                    "942120",
                    "942150",
                    "942180",
                    "942190",
                    "942200",
                    "942210",
                    "942230",
                    "942240",
                    "942260",
                    "942310",
                    "942340",
                    "942370",
                    "942380",
                    "942390",
                    "942400",
                    "942410",
                    "942430",
                    "942440",
                    "942450",
                ]
            }
            dns_zone_name  = "apps.hmcts.net"
            mode           = "Prevention"
            name           = "juror-bureau"
        },
      + {
          + backend_domain    = [
              + "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com",
            ]
          + cache_enabled     = "false"
          + custom_domain     = "darts.apps.hmcts.net"
          + dns_zone_name     = "apps.hmcts.net"
          + global_exclusions = [
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "code"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "error_description"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "darts_session"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "cookie_policy"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "user_ids"
                },
            ]
          + mode              = "Prevention"
          + name              = "darts-portal"
          + product           = "darts-portal"
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":828,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_static_webapp","Vars":{}} -->